#pragma once

#include "monad/grid/grid_3d_base.hpp"
#include "monad/fem/element/hex20.hpp"

namespace monad {

    /**
     * @brief 2D grid mesh of 4-node quadrilaterl (Hex20) elements.
     *
     * Example 3x2x2 grid:
     *
     * ```text
     *               o────o────o────o────o────o────o
     *              /         /         /         /│
     *             o         o         o         o │
     *            /         /         /         /  o
     *           o────o────o────o────o────o────o   │
     *          /         /         /         /│   │
     *         o         o         o         o │   o
     *        /         /         /         /  o  /│
     *       o────o────o────o────o────o────o   │ o │
     *       │         │         │         │   │/  o
     *       │         │         │         │   o   │
     *       o         o         o         o  /│   │
     *       │         │         │         │ o │   o
     *       │         │         │         │/  o  /
     *       o────o────o────o────o────o────o   │ o
     *       │         │         │         │   │/
     *       │         │         │         │   o
     *       o         o         o         o  /
     *       │         │         │         │ o
     *       │         │         │         │/
     *       o────o────o────o────o────o────o
     * ```
     *
     * Global axes:
     *
     * - x runs left→right.
     *
     * - y runs front→back.
     *
     * - z runs bottom→top.
     */
    class Hex20Grid : public Grid3dBase<Hex20Grid, fem::Hex20> {
    public:
        using Grid3dBase<Hex20Grid, fem::Hex20>::Grid3dBase;

        /// @brief Number of nodes.
        std::size_t numNodes() const noexcept;

        /// @brief Number of periodic nodes.
        std::size_t numPeriodicNodes() const noexcept;

        /**
         * @brief Coordinates for a specific node.
         *
         * Example 3x2x2 grid:
         *
         * ```text
         *               32───60───33───61───34───62───35
         *              /         /         /         /│
         *             83        84        85        86│
         *            /         /         /         / 110
         *           28───57───29───58───30───59───31  │
         *          /         /         /         /│   │
         *         79        80        81        82│   23
         *        /         /         /         / 106 /│
         *       24───54───25───55───26───56───27  │ 78│
         *       │         │         │         │   │/  98
         *       │         │         │         │   19  │
         *       99       100       101       102 /│   │
         *       │         │         │         │ 74│   11
         *       │         │         │         │/  94 /
         *       12───45───13───46───14───47───15  │ 70
         *       │         │         │         │   │/
         *       │         │         │         │   7
         *       87        88        89        90 /
         *       │         │         │         │ 66
         *       │         │         │         │/
         *       0────36───1────37───2────38───3
         * ```
         *
         * @param[in] index Node index.
         *
         * @returns Coordinates.
         *
         * @throws std::out_of_range if `index` is outside the range [0,`numNodes()`).
         */
        Point node(std::size_t index) const;

        /**
         * @brief Node indices for a specific element.
         *
         * Example 3x2x2 grid:
         *
         * ```text
         *               32───60───33───61───34───62───35
         *              /         /         /         /│
         *             83   𝟿    84   𝟷𝟶   85   𝟷𝟷   86│
         *            /         /         /         / 110
         *           28───57───29───58───30───59───31  │
         *          /         /         /         /│   │
         *         79        80        81        82│   23
         *        /         /         /         / 106 /│
         *       24───54───25───55───26───56───27  │ 78│
         *       │         │         │         │   │/  98
         *       │         │         │         │   19  │
         *       99   𝟼   100   𝟽   101   𝟾   102 /│   │
         *       │         │         │         │ 74│   11
         *       │         │         │         │/  94 /
         *       12───45───13───46───14───47───15  │ 70
         *       │         │         │         │   │/
         *       │         │         │         │   7
         *       87   𝟶    88   𝟷    89   𝟸    90 /
         *       │         │         │         │ 66
         *       │         │         │         │/
         *       0────36───1────37───2────38───3
         * ```
         *
         * @param[in] index Element index.
         *
         * @returns Node indices.
         *
         * @throws std::out_of_range if `index` is outside the range [0,`numElements()`).
         */
        ElementList element(std::size_t index) const;

        /**
         * @brief Periodic node indices for a specific element.
         *
         * Example 3x2x2 grid:
         *
         * ```text
         *               0────12───1────13───2────14───0
         *              /         /         /         /│
         *             27   𝟿    28   𝟷𝟶   29   𝟷𝟷   27│
         *            /         /         /         /  42
         *           3────15───4────16───5────17───3   │
         *          /         /         /         /│   │
         *         24        25        26        24│   6
         *        /         /         /         /  45 /│
         *       0────12───1────13───2────14───0   │ 33│
         *       │         │         │         │   │/  36
         *       │         │         │         │   9   │
         *       42   𝟼    43   𝟽    44   𝟾    42 /│   │
         *       │         │         │         │ 30│   0
         *       │         │         │         │/  39 /
         *       6────18───7────19───8────20───6   │ 27
         *       │         │         │         │   │/
         *       │         │         │         │   3
         *       36   𝟶    37   𝟷    38   𝟸    36 /
         *       │         │         │         │ 24
         *       │         │         │         │/
         *       0────12───1────13───2────14───0
         * ```
         *
         * @param[in] index Element index.
         *
         * @returns Periodic node indices.
         *
         * @throws std::out_of_range if `index` is outside the range [0,`numElements()`).
         */
        ElementList periodicElement(std::size_t index) const;
    };

} // namespace monad
