#pragma once

#include "monad/grid/grid_3d_base.hpp"
#include "monad/fem/element/hex8.hpp"

namespace monad {

    /**
     * @brief 2D grid mesh of 4-node quadrilaterl (Hex8) elements.
     *
     * Example 3x2x2 grid:
     *
     * ```text
     *               o─────────o─────────o─────────o
     *              /         /         /         /│
     *             /         /         /         / │
     *            /         /         /         /  │
     *           o─────────o─────────o─────────o   │
     *          /         /         /         /│   │
     *         /         /         /         / │   o
     *        /         /         /         /  │  /│
     *       o─────────o─────────o─────────o   │ / │
     *       │         │         │         │   │/  │
     *       │         │         │         │   o   │
     *       │         │         │         │  /│   │
     *       │         │         │         │ / │   o
     *       │         │         │         │/  │  /
     *       o─────────o─────────o─────────o   │ /
     *       │         │         │         │   │/
     *       │         │         │         │   o
     *       │         │         │         │  /
     *       │         │         │         │ /
     *       │         │         │         │/
     *       o─────────o─────────o─────────o
     * ```
     *
     * Global axes:
     *
     * - x runs left→right.
     *
     * - y runs front→back.
     *
     * - z runs bottom→top.
     */
    class Hex8Grid : public Grid3dBase<Hex8Grid, fem::Hex8> {
    public:
        using Grid3dBase<Hex8Grid, fem::Hex8>::Grid3dBase;

        /// @brief Number of nodes.
        std::size_t numNodes() const noexcept;

        /// @brief Number of periodic nodes.
        std::size_t numPeriodicNodes() const noexcept;

        /**
         * @brief Coordinates for a specific node.
         *
         * Example 3x2x2 grid:
         *
         * ```text
         *               32────────33────────34────────35
         *              /         /         /         /│
         *             /         /         /         / │
         *            /         /         /         /  │
         *           28────────29────────30────────31  │
         *          /         /         /         /│   │
         *         /         /         /         / │   23
         *        /         /         /         /  │  /│
         *       24────────25────────26────────27  │ / │
         *       │         │         │         │   │/  │
         *       │         │         │         │   19  │
         *       │         │         │         │  /│   │
         *       │         │         │         │ / │   11
         *       │         │         │         │/  │  /
         *       12────────13────────14────────15  │ /
         *       │         │         │         │   │/
         *       │         │         │         │   7
         *       │         │         │         │  /
         *       │         │         │         │ /
         *       │         │         │         │/
         *       0─────────1─────────2─────────3
         * ```
         *
         * @param[in] index Node index.
         *
         * @returns Coordinates.
         *
         * @throws std::out_of_range if `index` is outside the range [0,`numNodes()`).
         */
        Point node(std::size_t index) const;

        /**
         * @brief Node indices for a specific element.
         *
         * Example 3x2x2 grid:
         *
         * ```text
         *               32────────33────────34────────35
         *              /         /         /         /│
         *             /    𝟿    /    𝟷𝟶   /    𝟷𝟷   / │
         *            /         /         /         /  │
         *           28────────29────────30────────31  │
         *          /         /         /         /│   │
         *         /         /         /         / │   23
         *        /         /         /         /  │  /│
         *       24────────25────────26────────27  │ / │
         *       │         │         │         │   │/  │
         *       │         │         │         │   19  │
         *       │    𝟼    │    𝟽    │    𝟾    │  /│   │
         *       │         │         │         │ / │   11
         *       │         │         │         │/  │  /
         *       12────────13────────14────────15  │ /
         *       │         │         │         │   │/
         *       │         │         │         │   7
         *       │    𝟶    │    𝟷    │    𝟸    │  /
         *       │         │         │         │ /
         *       │         │         │         │/
         *       0─────────1─────────2─────────3
         * ```
         *
         * @param[in] index Element index.
         *
         * @returns Node indices.
         *
         * @throws std::out_of_range if `index` is outside the range [0,`numElements()`).
         */
        ElementList element(std::size_t index) const;

        /**
         * @brief Periodic node indices for a specific element.
         *
         * Example 3x2x2 grid:
         *
         * ```text
         *               0─────────1─────────2─────────0
         *              /         /         /         /│
         *             /    𝟿    /    𝟷𝟶   /    𝟷𝟷   / │
         *            /         /         /         /  │
         *           3─────────4─────────5─────────3   │
         *          /         /         /         /│   │
         *         /         /         /         / │   6
         *        /         /         /         /  │  /│
         *       0─────────1─────────2─────────0   │ / │
         *       │         │         │         │   │/  │
         *       │         │         │         │   9   │
         *       │    𝟼    │    𝟽    │    𝟾    │  /│   │
         *       │         │         │         │ / │   0
         *       │         │         │         │/  │  /
         *       6─────────7─────────8─────────6   │ /
         *       │         │         │         │   │/
         *       │         │         │         │   3
         *       │    𝟶    │    𝟷    │    𝟸    │  /
         *       │         │         │         │ /
         *       │         │         │         │/
         *       0─────────1─────────2─────────0
         * ```
         *
         * @param[in] index Element index.
         *
         * @returns Periodic node indices.
         *
         * @throws std::out_of_range if `index` is outside the range [0,`numElements()`).
         */
        ElementList periodicElement(std::size_t index) const;
    };

} // namespace monad
